12/data/attachments/f6ecbc1fbe08501b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Darrell_market_Friend_30660_3</nif:username>
            <nif:friendToBeRequested>soap_friends_2fd3d9cc-d388-43ad-bd6b-19b33b81e3cb</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>